## 1.문제 정의 
- 생존자와 사망자를 예측하자

## 2. 데이터 수집

In [1]:
import pandas as pd
train =pd.read_csv('train.csv')
test =pd.read_csv('test.csv')

In [2]:
train.shape, test.shape

((891, 12), (418, 11))

In [ ]:
#앞 숫자 데이터의 겟수니까 달라도 되는데 뒤의 숫자는 컬럼 이여서 다르면 안됨

In [3]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
test.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
#이제 train으로 학습하고 test로 테스트 
#이제 test에는 정답이 없다 알고 싶으면 이거 케글에 올려야 험

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
PassengerId = 좌석 번호 sibsp = 함께 탑승한 형제 또는 배우자의 수 parch =함께 탑승한 부모 또는 자녀의 수
Cabin =선실번호

In [ ]:
객실의 등급: 아래로 떨어질수록

<table border=0 align=left width=700>
  <tr><th>feature<th width=200>의미<th width=300>설명<th> 타입
  <tr><td>Survivied<td>생존여부<td>target 라벨 (0 : 사망, 1 : 생존)<td>integer
  <tr><td>Pclass<td>티켓의 클래스<td>1 = 1등석, 2 = 2등석, 3 = 3등석<td>integer 
  <tr><td>Sex<td>성별<td>male, female로 구분<td>string    
  <tr><td>Age<td>나이<td>0-80세<td>integer
  <tr><td>SibSp<td>함께 탑승한 형제와 배우자의 수<td><td>integer
  <tr><td>Parch<td>함께 탑승한 부모, 아이의 수<td><td>integer
  <tr><td>Ticket<td>티켓 번호<td>alphabat + integer<td>integer
  <tr><td>Fare<td>탑승료<td><td>float
  <tr><td>Cabin<td>객실 번호<td>alphabat + integer<td>string
  <tr><td>Embarked<td>탑승 항구<td>C = Cherbourg, Q = Queenstown, S = Southampton<td>string
</table>

# 데이터 전처리

In [7]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
#결측치 처리 해야 하는 컬럼: age cabin Embarked
#타입 처리해야 하는 컬럼: name, Sex, Ticket, Cabin, Embarked

In [8]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [ ]:
#결측치 처리 해야 하는 컬럼: age Fare, Cabin 
#타입 처리해야 하는 컬럼: name, Sex, Ticket, Cabin, Embarked

In [9]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Train의 embark 결측치 제거하기

In [11]:
train["Embarked"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Embarked
Non-Null Count  Dtype
--------------  -----
889 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB

In [13]:
train["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
#그냥 별로 차이가 없어서 임의로 채우자
#최빈값으로 채우기

In [15]:
#train["Embarked"]=train["Embarked"].fillna('S')
#이렇게 담아주던지 이렇게 iniplace속성 사용
train["Embarked"].fillna('S',inplace=True)

In [ ]:
#Fare먼저 처리하고 C공통인 다른 결측치 제거하기

In [16]:
test['Fare'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 418 entries, 0 to 417
Series name: Fare
Non-Null Count  Dtype
--------------  -----
417 non-null    float64
dtypes: float64(1)
memory usage: 3.4 KB

In [17]:
#최빈값이 없다
test["Fare"].describe()

count    417.000000
mean      35.627188
std       55.907576
min        0.000000
25%        7.895800
50%       14.454200
75%       31.500000
max      512.329200
Name: Fare, dtype: float64

## Fare에서는 중앙값이 더 채우는게 좋음

In [18]:
 #14.45
test["Fare"]. fillna(14.45, inplace =True)

## age결측치 채우기

In [20]:
train["Age"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Age
Non-Null Count  Dtype
--------------  -----
714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

## 결측치가 너무 많아 단순 통계치로 채우기가 힘들다

In [21]:
#상관관계를 확인하고 그에 맞게 채워보자
train.corr()

C:\Users\gjaischool\AppData\Local\Temp\ipykernel_14416\830310742.py:2: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  train.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [26]:
age_table =train[['Pclass','Sex','Age']].groupby(by =["Pclass","Sex"]).median()
#좌석등급으로 그룹을 나누고 이것의 중앙값을 나오게 함

In [ ]:
#애는 인덱스가 두개인 다중인덱스 가지고 오는 방법은 크게 다르지 않음
#각 행의 나이값을 살펴보고 나이가 결측치라면 객실등급과 상별 확인후 위에 만든 테이블 값을 사용

In [27]:
train.iloc[17]

PassengerId                              18
Survived                                  1
Pclass                                    2
Name           Williams, Mr. Charles Eugene
Sex                                    male
Age                                     NaN
SibSp                                     0
Parch                                     0
Ticket                               244373
Fare                                   13.0
Cabin                                   NaN
Embarked                                  S
Name: 17, dtype: object

In [28]:
#.apply()
#복잡한 계산을 행이나 열 단위로 진행해주는 함수
#복잡한 계산을 함수의 형태로 만들어 주어야 반영을 할 수 있음
#하나의 행에 한 사람의 데이터가 들어갈것임

In [29]:
import numpy as np
def fill_age(person):
    if np.isnan(person['Age']):#결측치 라면
        return age_table.loc[person['Pclass'],person["Sex"]].values[0]
    else:
        return person["Age"]
    #이 index의 value값만 가져온다 
   #그냥 출력하면 arr로 나오기 때문에 어차피 하나의 데이터 밖에 없어서 인덱싱 0 추가

In [33]:
#axis =1 행 단위로 데이터를 채워주세요 
train["Age"]= train.apply(fill_age, axis=1)
test["Age"]= test.apply(fill_age, axis=1)
#매개변수로 들어갈 값이 안들어감
#근데 이렇게 하면 고정된 값을 사용하기 때문에 오직 애 하나만 사용하겠다
#그냥 함수자체만 쓰면 함수자체를 사용하겠다는 의미
#이 apply 라는 함수가 axis =1이라는 옵션에 의해 행or열 중 하나를 이 함수 안에 집어넣음

In [34]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         418 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB